ist_of_dicts = [
    {
        'Волгоград': 6,
        'Екатеринбург': 3,
        'Краснодар': 1,
        'Санкт-Петербург': 5,
        'Саратов': 2,
        'Тюмень': 6,
        'Уфа': 8
    },
    {
        'Волгоград': 1, 
        'Махачкала': 7, 
        'Новосибирск': 6, 
        'Самара': 7, 
        'Уфа': 5
    },
    {
        'Барнаул': 2,
        'Воронеж': 8,
        'Краснодар': 9,
        'Красноярск': 4,
        'Махачкала': 1,
        'Оренбург': 2,
        'Ростов-на-Дону': 1,
        'Самара': 1,
        'Тюмень': 2,
        'Хабаровск': 1
    },
    {
        'Владивосток': 3,
        'Воронеж': 4,
        'Ижевск': 9,
        'Иркутск': 6,
        'Казань': 2,
        'Краснодар': 5,
        'Нижний Новгород': 7,
        'Ульяновск': 1,
        'Челябинск': 7
    }
]

a1,a2,a3,a4 = ist_of_dicts
result = {}
for key in (a1.keys() | a2.keys() | a3.keys() | a4.keys()):
     if key in a1: result.setdefault(key, []).append(a1[key])
     if key in a2: result.setdefault(key, []).append(a2[key])
     if key in a3: result.setdefault(key, []).append(a3[key])
     if key in a4: result.setdefault(key, []).append(a4[key])
from pprint import pprint
pprint(result)


# {'Барнаул': [2],
 # 'Владивосток': [3],
 # 'Волгоград': [6, 1],
 # 'Воронеж': [8, 4],
 # 'Екатеринбург': [3],
 # 'Ижевск': [9],
 # 'Иркутск': [6],
 # 'Казань': [2],
 # 'Краснодар': [1, 9, 5],
 # 'Красноярск': [4],
 # 'Махачкала': [7, 1],
 # 'Нижний Новгород': [7],
 # 'Новосибирск': [6],
 # 'Оренбург': [2],
 # 'Ростов-на-Дону': [1],
 # 'Самара': [7, 1],
 # 'Санкт-Петербург': [5],
 # 'Саратов': [2],
 # 'Тюмень': [6, 2],
 # 'Ульяновск': [1],
 # 'Уфа': [8, 5],
 # 'Хабаровск': [1],
 # 'Челябинск': [7]}