x = (input("Введите координаты первой клетки по вертикали: "))  
a = (int(input("Введите координаты первой клетки по горизонтали: ")))
y = (input("Введите координаты второй клетки по вертикали: "))  
b = (int(input("Введите координаты второй клетки по горизонтали: ")))

if  (a + b)%2 == 0:
    print ("Нет") 
else:
    print ("Да") 

# Введите координаты первой клетки по вертикали: a
# Введите координаты первой клетки по горизонтали: 1
# Введите координаты второй клетки по вертикали: b
# Введите координаты второй клетки по горизонтали: 2
# Да

# Так же

# x = (input("Введите координаты первой клетки: "))  
# list1 = ['a1','a3','a5','a7','c1','c3','c5','c7','e1','e3','e5','e7','g1','g3','g5','g7']
# list = ['b2','b4','b6','b8', 'd2','d4','f6','h8','f2','f4','f6','f8','h2','h4','h6','h8']
# if  x and  in list1:
    # print ("Да") 
# else:
    # print ("Нет") 
    
    
# Введите координаты первой клетки: a1
# Введите координаты второй клетки: b2
# yes