x = (input("Введите координаты первой клетки по вертикали: "))  
x1 = (int(input("Введите координаты первой клетки по горизонтали: ")))
y = (input("Введите координаты второй клетки по вертикали: "))  
y1 = (int(input("Введите координаты второй клетки по горизонтали: ")))

if  x == y or  x1 == y1 :
    print ("Да") 
else:
    print ("Нет") 


# Введите координаты первой клетки по вертикали: d
# Введите координаты первой клетки по горизонтали: 4
# Введите координаты второй клетки по вертикали: e
# Введите координаты второй клетки по горизонтали: 4
# Да

# Введите координаты первой клетки по вертикали: a
# Введите координаты первой клетки по горизонтали: 2
# Введите координаты второй клетки по вертикали: c
# Введите координаты второй клетки по горизонтали: 4
# Нет